<?PHP
/**
 *  +--------------------------------------------------------------
 *  | Copyright (c) 2016 DZLZH All rights reserved.
 *  +--------------------------------------------------------------
 *  | Author: DZLZH <dzlzh@null.net>
 *  +--------------------------------------------------------------
 *  | Filename: algorithm.php
 *  +--------------------------------------------------------------
 *  | Last modified: 2016-09-27 22:49
 *  +--------------------------------------------------------------
 *  | Description: 
 *  +--------------------------------------------------------------
 */


$stratTime = microtime(true);
$startMemory = memory_get_usage();

$sum = 0;
$n   = 100000000;

// for ($i = 0; $i <= $n; $i++) {
   // $sum += $i;
// }

// PHP 5.4
// 运算结果:5000000050000000
// 运行时间:4228.6379337311毫秒
// 耗费内存:0.6953125K
// PHP 7
// 运算结果:5000000050000000
// 运行时间:1657.2029590607毫秒
// 耗费内存:0.03125K

$sum = (1 + $n) * $n / 2;

// PHP 5.4
// 运算结果:5000000050000000
// 运行时间:0.046014785766602毫秒
// 耗费内存:0.578125K
// PHP 7
// 运算结果:5000000050000000
// 运行时间:0.031948089599609毫秒
// 耗费内存:0.03125K

echo "运算结果:", $sum, "\n";

$endTime = microtime(true);
$endMemory = memory_get_usage();

$runTime = ($endTime - $stratTime) * 1000;
$usedMemory = ($endMemory - $startMemory) / 1024;

echo "运行时间:", $runTime, "毫秒\n";
echo "耗费内存:", $usedMemory, "K";
